In [46]:
import pandas as pd 
import datetime as dt

In [47]:
# Define the file path
file_path = r'C:\Users\navje\OneDrive\Desktop\data_analysis\Climate_Change_Analysis\Data\GlobalLandTemperaturesByState.csv'

# Load the CSV file into a pandas DataFrame
state_df = pd.read_csv(file_path)

In [48]:
pd.options.display.max_colwidth = 200
state_df.head()

           dt  AverageTemperature  AverageTemperatureUncertainty State Country
0  1855-05-01              25.544                          1.171  Acre  Brazil
1  1855-06-01              24.228                          1.103  Acre  Brazil
2  1855-07-01              24.371                          1.044  Acre  Brazil
3  1855-08-01              25.427                          1.073  Acre  Brazil
4  1855-09-01              25.675                          1.014  Acre  Brazil

In [49]:
columns = state_df.columns.to_list()
# Or, you can use: columns = list(orders_df)
columns

['dt',
 'AverageTemperature',
 'AverageTemperatureUncertainty',
 'State',
 'Country']

In [50]:
state_df.dtypes

dt                                object
AverageTemperature               float64
AverageTemperatureUncertainty    float64
State                             object
Country                           object
dtype: object

In [51]:
state_df["dt"] = pd.to_datetime(state_df["dt"])

In [52]:
state_df.dtypes

dt                               datetime64[ns]
AverageTemperature                      float64
AverageTemperatureUncertainty           float64
State                                    object
Country                                  object
dtype: object

In [53]:
state_df["State"].unique()
len(state_df["State"].unique())

241

In [54]:
states_grouped = state_df.groupby("State")
states_grouped.head()

,dt,AverageTemperature,AverageTemperatureUncertainty,State,Country
0,1855-05-01,25.544,1.171,Acre,Brazil
1,1855-06-01,24.228,1.103,Acre,Brazil
2,1855-07-01,24.371,1.044,Acre,Brazil
3,1855-08-01,25.427,1.073,Acre,Brazil
4,1855-09-01,25.675,1.014,Acre,Brazil
...,...,...,...,...,...
643602,1841-01-01,3.562,2.722,Zhejiang,China
643603,1841-02-01,4.972,1.955,Zhejiang,China
643604,1841-03-01,8.406,2.271,Zhejiang,China
643605,1841-04-01,14.058,2.229,Zhejiang,China
643606,1841-05-01,19.300,1.753,Zhejiang,China

In [55]:
state_earliest_date = states_grouped["dt"].min().max()
state_earliest_date

Timestamp('1883-01-01 00:00:00')

In [56]:
state_latest_date = states_grouped["dt"].max().min()
state_latest_date

Timestamp('2013-09-01 00:00:00')

In [57]:
formatted_date = state_earliest_date.strftime('%Y-%m-%d')
print(formatted_date)

1883-01-01

In [58]:
date_range = (f"Our date range is {state_earliest_date} to {state_latest_date}")
print(date_range)

Our date range is 1883-01-01 00:00:00 to 2013-09-01 00:00:00

In [59]:
# Drop rows where the date is before 1950
cleaned_states = state_df[state_df['dt'].dt.year >= 1950]
cleaned_states

,dt,AverageTemperature,AverageTemperatureUncertainty,State,Country
1136,1950-01-01,25.906,0.347,Acre,Brazil
1137,1950-02-01,25.973,0.268,Acre,Brazil
1138,1950-03-01,25.759,0.495,Acre,Brazil
1139,1950-04-01,25.810,0.484,Acre,Brazil
1140,1950-05-01,25.610,0.420,Acre,Brazil
...,...,...,...,...,...
645670,2013-05-01,21.634,0.578,Zhejiang,China
645671,2013-06-01,24.679,0.596,Zhejiang,China
645672,2013-07-01,29.272,1.340,Zhejiang,China
645673,2013-08-01,29.202,0.869,Zhejiang,China
645674,2013-09-01,NaN,NaN,Zhejiang,China

In [60]:
cleaned_states.head()

,dt,AverageTemperature,AverageTemperatureUncertainty,State,Country
1136,1950-01-01,25.906,0.347,Acre,Brazil
1137,1950-02-01,25.973,0.268,Acre,Brazil
1138,1950-03-01,25.759,0.495,Acre,Brazil
1139,1950-04-01,25.810,0.484,Acre,Brazil
1140,1950-05-01,25.610,0.420,Acre,Brazil

In [61]:

cleaned_states_grouped = cleaned_states.groupby(state_df["State"])
cleaned_states_grouped.head()

,dt,AverageTemperature,AverageTemperatureUncertainty,State,Country
1136,1950-01-01,25.906,0.347,Acre,Brazil
1137,1950-02-01,25.973,0.268,Acre,Brazil
1138,1950-03-01,25.759,0.495,Acre,Brazil
1139,1950-04-01,25.810,0.484,Acre,Brazil
1140,1950-05-01,25.610,0.420,Acre,Brazil
...,...,...,...,...,...
644910,1950-01-01,7.775,0.482,Zhejiang,China
644911,1950-02-01,5.904,0.361,Zhejiang,China
644912,1950-03-01,11.137,0.481,Zhejiang,China
644913,1950-04-01,15.338,0.681,Zhejiang,China
644914,1950-05-01,20.354,0.461,Zhejiang,China

In [62]:
cleaned_states_grouped_dropna = cleaned_states.dropna()
cleaned_states_grouped_dropna

,dt,AverageTemperature,AverageTemperatureUncertainty,State,Country
1136,1950-01-01,25.906,0.347,Acre,Brazil
1137,1950-02-01,25.973,0.268,Acre,Brazil
1138,1950-03-01,25.759,0.495,Acre,Brazil
1139,1950-04-01,25.810,0.484,Acre,Brazil
1140,1950-05-01,25.610,0.420,Acre,Brazil
...,...,...,...,...,...
645669,2013-04-01,15.710,0.461,Zhejiang,China
645670,2013-05-01,21.634,0.578,Zhejiang,China
645671,2013-06-01,24.679,0.596,Zhejiang,China
645672,2013-07-01,29.272,1.340,Zhejiang,China
645673,2013-08-01,29.202,0.869,Zhejiang,China

In [63]:
#states_final_df = cleaned_states_grouped_dropna.groupby(state_df["State"])
#states_final_df.head()

In [64]:
#states_final_df.head()

In [65]:
# Now you can use to_csv on the resulting DataFrame
states_final_df.to_csv("states_output.csv")

AttributeError: 'DataFrameGroupBy' object has no attribute 'to_csv'